Repository: babubra/MoneyPapaIos
Catalog: Monpapa/Monpapa/Localizable.xcstrings
Source language: ru
Languages: en

# %@ из %@
source: %1$@ из %2$@
en: %1$@ of %2$@

source: $ Доллар
en: $ Dollar

source: € Евро
en: € Euro

source: ₽ Рубль
en: ₽ Ruble

source: 1 долг
en: 1 debt

source: AI распознал транзакцию
en: AI recognized the transaction

source: AI-парсинг
en: AI Parsing

# auth.error.invalidCredentials
source: Неверный или просроченный код
en: Invalid or expired code

# auth.error.invalidResponse
source: Неожиданный ответ сервера
en: Unexpected server response

# auth.error.network %@
source: Ошибка сети: %@
en: Network error: %@

# auth.error.notAuthenticated
source: Пользователь не авторизован
en: User is not authenticated

# auth.error.server %lld %@
source: Ошибка сервера (%1$lld): %2$@
en: Server error (%1$lld): %2$@

# error.audioRateLimit
source: Превышен лимит аудио-запросов. Попробуйте позже.
en: Audio request limit exceeded. Try again later.

# error.audioSetup %@
source: Не удалось настроить аудио: %@
en: Failed to set up audio: %@

# error.audioStart %@
source: Не удалось начать запись: %@
en: Failed to start recording: %@

# error.decoding %@
source: Не удалось разобрать ответ: %@
en: Failed to parse response: %@

# error.encodingFailed %@
source: Ошибка кодирования: %@
en: Encoding error: %@

# error.invalidResponse
source: Неожиданный ответ сервера
en: Unexpected server response

# error.network.cannotConnect
source: Не удалось связаться с сервером. Попробуйте позже.
en: Unable to reach the server. Try again later.

# error.network.generic
source: Ошибка сети. Проверьте подключение и попробуйте снова.
en: Network error. Check your connection and try again.

# error.network.offline
source: Нет подключения к интернету. Проверьте связь и попробуйте снова.
en: No internet connection. Check your connection and try again.

# error.network.timeout
source: Сервер не отвечает. Попробуйте позже.
en: Server is not responding. Try again later.

# error.noActiveDebts %@
source: Нет активных долгов с %@. Сначала создайте долг.
en: No active debts with %@. Create a debt first.

# error.noCounterpart
source: Не удалось определить, кому платёж. Уточните имя.
en: Could not determine the recipient. Please specify the name.

# error.noRecording
source: Не удалось получить запись
en: Failed to get the recording

# error.noToken
source: Устройство не авторизовано — попробуйте перезапустить приложение
en: Device not authorized — try restarting the app

# error.parseRejected
source: Не удалось распознать операцию. Попробуйте иначе.
en: Could not recognize the transaction. Try rephrasing.

# error.rateLimit
source: Достигнут дневной лимит AI-запросов. Попробуйте завтра.
en: Daily AI request limit reached. Try again tomorrow.

# error.rateLimitShort
source: Достигнут дневной лимит AI-запросов
en: Daily AI request limit reached

# error.recordingFailed
source: Запись завершилась с ошибкой
en: Recording ended with an error

# error.recordingFileNotFound
source: Файл записи не найден
en: Recording file not found

# error.server %lld %@
source: Ошибка сервера (%1$lld): %2$@
en: Server error (%1$lld): %2$@

# error.silenceTimeout
source: Я вас не слышу. Попробуйте ещё раз.
en: I can't hear you. Please try again.

# error.unknownError
source: Неизвестная ошибка
en: Unknown error

# Item at %@
source: Item at %1
en: Item at %@

# settings.currency.default
source: Валюта по умолчанию
en: Default currency

# settings.currency.title
source: Валюта
en: Currency

# settings.language.footer
source: Интерфейс будет использовать выбранный язык вместо системного.
en: The interface will use the selected language instead of the system language.

# settings.language.label
source: Язык приложения
en: App language

# settings.language.restartHint
source: Для полной смены языка перезапустите приложение.
en: Restart the app to fully apply the language change.

# settings.language.system
source: По системе
en: System

# settings.language.title
source: Язык
en: Language

# stats.summary.countOnly %lld
source: %lld операций
en: %lld transactions

# stats.summary.full %lld %@
source: %1$lld операций · в среднем %2$@/день
en: %1$lld transactions · avg %2$@/day

source: Авторизуйтесь
en: Sign In

source: Авторизуйтесь, чтобы сохранить доступ к транзакциям и синхронизировать данные между устройствами.
en: Sign in to keep your access to transactions and synchronize data across your devices.

source: Аккаунт
en: Account

source: Активен
en: Active

source: Активные
en: Active

source: Активные долги
en: Active debts

source: Аналитика
en: Analytics

source: Баланс
en: Balance

source: Без имени
en: No name

source: Без категории
en: Uncategorized

source: Без описания
en: No description

source: Без родителя
en: No parent

source: Валюта
en: Currency

source: Валюта по умолчанию
en: Default currency

source: Ваш Email
en: Your Email

# Ваши данные в безопасности
source: Ваши данные\nв безопасности
en: Your data\nis secure

source: Введите код
en: Enter code

source: Введите первую транзакцию в поле ниже
en: Enter your first transaction in the field below

source: Вернул часть, перевод на карту...
en: Returned part, transfer to card...

source: Взял в долг
en: Borrowed

source: Внешний вид
en: Appearance

source: Войдите по Magic Link
en: Sign in with Magic Link

source: Войдите, чтобы синхронизировать данные между устройствами и не потерять их
en: Sign in to sync data across devices and keep it safe

# Войдите, чтобы синхронизировать данные между устройствами и не потерять их
source: Войдите, чтобы синхронизировать данные\nмежду устройствами и не потерять их
en: Sign in to sync your data\nacross devices and never lose it

source: Войти в профиль
en: Sign in to profile

source: Войти по Email
en: Sign in with Email

source: Войти с помощью Apple
en: Sign in with Apple

source: Все
en: All

source: Всё
en: All

source: Все →
en: All →

source: Все ваши данные будут безвозвратно удалены с сервера. Это действие невозможно отменить.
en: All your data will be permanently deleted from the server. This action cannot be undone.

source: Все транзакции, категории и настройки будут удалены безвозвратно. Это действие невозможно отменить.
en: All transactions, categories and settings will be permanently deleted. This action cannot be undone.

# Вся сумма (%@)
source: Вся сумма (%1$@)
en: Full amount (%@)

source: Вход
en: Login

source: вчера
en: yesterday

source: Вчера
en: Yesterday

source: Выберите
en: Select

source: Выберите, к какому долгу отнести платёж
en: Select which debt to apply the payment to

source: Выбрать существующую
en: Choose existing

source: Выйти из аккаунта
en: Log out

source: выплачено
en: paid

source: Главная
en: Home

source: Год
en: Year

source: Готово
en: Done

source: Дал в долг
en: Lent

source: Далее
en: Next

source: Данные на всех устройствах. Войдите — и ничего не потеряется
en: Data on all devices. Sign in — and nothing is lost

source: Дата
en: Date

source: Дата долга
en: Debt date

source: Дата платежа
en: Payment date

source: День
en: Day

source: Детали операции
en: Transaction details

source: Динамика
en: Timeline

source: Для голосового ввода транзакций нужен доступ к микрофону. Включите его в Настройках → MonPapa → Микрофон.
en: Microphone access is needed for voice input. Enable it in Settings → MonPapa → Microphone.

source: Добавить долг
en: Add debt

source: Добавьте комментарий...
en: Add a comment...

source: Добавьте транзакции, и здесь появится статистика
en: Add transactions and statistics will appear here

# Добро пожаловать в MonPapa!
source: Добро пожаловать\nв MonPapa!
en: Welcome\nto MonPapa!

source: Доброе утро ☀️
en: Good morning ☀️

source: Добрый вечер 🌙
en: Good evening 🌙

source: Добрый день 👋
en: Good afternoon 👋

source: Долг
en: Debt

source: Долг будет полностью закрыт
en: The debt will be fully closed

source: Долг закрыт
en: Debt closed

source: Долг и все платежи по нему будут удалены.
en: The debt and all its payments will be deleted.

source: Долги
en: Debts

source: Доступ к микрофону
en: Microphone Access

source: Доход
en: Income

source: доходы
en: income

source: Доходы
en: Income

source: Забыли пароль?
en: Forgot password?

source: Закрыт
en: Closed

# Закрытые (%lld)
source: Закрытые (%1$lld)
en: Closed (%lld)

source: Закрыть
en: Close

source: Закрыть долг
en: Close debt

source: Записать платёж
en: Record payment

source: Здесь будут графики и аналитика
en: Charts and analytics will be here

source: Иконка
en: Icon

source: или
en: or

source: Или
en: Or

source: Имя...
en: Name...

source: История платежей
en: Payment history

source: Итого
en: Total

source: Категория
en: Category

source: Категория с таким именем уже существует
en: A category with this name already exists

source: Код отправлен на:
en: Code sent to:

source: Комментарий
en: Comment

source: Кому
en: To whom

source: Лимит %lld сек
en: %lld sec left

source: Мес.
en: Mon.

source: Месяц
en: Month

source: Мне должны
en: I am owed

source: Мы отправим одноразовый код на ваш email.
en: We will send a one-time code to your email.

source: На ремонт, до зарплаты...
en: For repairs, until payday...

source: Наговорите голосом: «Купил молока за 80 рублей» — AI автоматически предложит категорию и заполнит все поля. Останется только проверить и сохранить!
en: Say it with your voice: «Bought milk for 80 rubles» — AI will automatically suggest a category and fill in all the fields. You just need to check and save!

source: Назад
en: Back

source: Название категории
en: Category name

source: Найти категорию
en: Find category

source: Настройки
en: Settings

source: Не спится? 🦉
en: Can't sleep? 🦉

source: Не удалось сохранить категорию. Попробуйте ещё раз.
en: Failed to save category. Please try again.

source: Нед.
en: Wk.

source: Неделя
en: Week

source: Несколько долгов
en: Multiple debts

source: Нет активных долгов
en: No active debts

source: Нет данных за выбранный период
en: No data for the selected period

source: Нет данных по категориям
en: No category data

source: нет долгов
en: no debts

source: Нет долгов
en: No debts

source: Нет транзакций
en: No transactions

source: Нет транзакций за выбранный период
en: No transactions in the selected period

source: Ничего не найдено
en: Nothing found

source: Новая категория
en: New category

source: Новая операция
en: New operation

source: Новый долг
en: New debt

source: Обед в кафе, продукты...
en: Lunch at a cafe, groceries...

source: Облачная синхронизация
en: Cloud synchronization

# Обновлено: %@
source: Обновлено: %1$@
en: Updated: %@

source: ОК
en: OK

source: Операции
en: Transactions

# Оплачено: %@ из %@
source: Оплачено: %1$@ из %2$@
en: Paid: %1$@ of %2$@

# Останется: %@
source: Останется: %1$@
en: Will remain: %@

source: остаток
en: balance

source: остаток из %@
en: remaining from %@

# остаток: %@
source: остаток: %1$@
en: remaining: %@

source: Открыть Настройки
en: Open Settings

source: Отмена
en: Cancel

source: Отправить код повторно
en: Resend code

# Отправить повторно через %lld сек
source: Отправить повторно через %1$lld сек
en: Resend in %lld sec

source: Ошибка
en: Error

source: Ошибка удаления
en: Deletion error

source: Период
en: Period

source: По
en: To

source: Подкатегории
en: Subcategories

source: Подтверждение
en: Confirmation

source: Пожалуйста, подождите...
en: Please wait...

source: Поиск категории...
en: Search category...

source: Поиск по категориям...
en: Search categories...

source: Поиск транзакций...
en: Search transactions...

source: Пока нет данных
en: No data yet

source: Пока нет платежей
en: No payments yet

source: Пока нет транзакций
en: No transactions yet

source: Получить код
en: Get code

source: Понятная статистика расходов и доходов в реальном времени
en: Clear expense and income statistics in real time

source: Попробуйте другой запрос или создайте новую категорию
en: Try a different query or create a new category

source: Попробуйте изменить поисковый запрос
en: Try changing your search query

source: Последние операции
en: Recent transactions

source: Пр.год
en: Pr.yr.

source: Пр.мес.
en: Pr.mon.

source: Привет, Папа! 👋
en: Hello, Dad! 👋

source: Приложение для простого и эффективного учёта доходов и расходов. Ничего лишнего — только то, что действительно нужно.
en: App for simple and effective income and expense tracking. Nothing extra — only what you really need.

source: Применить
en: Apply

source: Продолжить без входа
en: Continue without signing in

source: Произвольный
en: Custom

source: Пропустить
en: Skip

source: Просрочен
en: Overdue

source: Просто скажите или напишите «Купил кофе 200 руб» — AI всё поймёт
en: Just say or type "Bought coffee 200 rub" — AI gets it

source: Прошлый год
en: Previous year

source: Прошлый месяц
en: Previous month

source: Работает ИИ...
en: AI is working...

source: Распознанный текст AI
en: Recognized AI text

source: Расход
en: Expense

source: расходы
en: expenses

source: Расходы
en: Expenses

source: Регистрация
en: Sign up

source: Редактирование
en: Editing

source: Редактировать
en: Edit

source: Родитель
en: Parent

source: С
en: From

source: Сбросить фильтр
en: Reset filter

source: Светлая
en: Light

source: Свой
en: Custom

source: Свой период
en: Custom range

source: сегодня
en: today

source: Сегодня
en: Today

source: Семейные финансы
en: Family finances

source: Семейные финансы под контролем AI
en: Family finances powered by AI

source: Синхронизация
en: Sync

source: Синхронизация и бэкап в облако
en: Cloud sync and backup

source: Синхронизация...
en: Syncing...

source: Системная
en: System

source: Скажите голосом: «Купил кофе за 200 руб» — или введите текст в поле ниже
en: Say by voice: 'Bought coffee for 200 rub' — or type in the field below

source: Скоро здесь будет список всех транзакций
en: A list of all transactions will appear here soon

source: Создать
en: Create

source: Создать категорию
en: Create category

# Создать транзакцию проще простого!
source: Создать транзакцию\nпроще простого!
en: Creating a transaction\nis easier than ever!

source: Сохранить
en: Save

source: Сравнение с прошлым периодом
en: Compared to previous period

source: Срок возврата
en: Due date

source: Статистика
en: Stats

# Сумма превышает остаток (%@)
source: Сумма превышает остаток (%1$@)
en: Amount exceeds remaining balance (%@)

source: Текущий год
en: Current year

source: Текущий месяц
en: Current month

source: Тема
en: Theme

source: Тёмная
en: Dark

source: Топ категорий
en: Top categories

source: Транзакции
en: Transactions

source: Транзакция будет удалена.
en: Transaction will be deleted.

source: У вас нет активных долгов. Шикарно!
en: You have no active debts. Awesome!

source: У кого
en: From whom

source: Убрать
en: Remove

source: Удаление...
en: Deleting...

source: Удалить
en: Delete

source: Удалить аккаунт
en: Delete account

source: Удалить аккаунт и все данные
en: Delete account and all data

source: Удалить аккаунт?
en: Delete account?

source: Удалить долг?
en: Delete debt?

source: Удалить транзакцию?
en: Delete transaction?

source: Уточните недостающие данные
en: Clarify missing data

source: Фильтр по категориям
en: Category filter

source: Я взял в долг
en: I borrowed

source: Я дал в долг
en: I lent

source: Я должен
en: I owe

# aiHint.groceries
source: Купил продукты в магните 1500
en: Groceries at Walmart 45

# aiHint.transfer
source: Перевел жене 5000
en: Sent $150 to my wife

# aiHint.lunch
source: Бизнес-ланч 450 руб
en: Business lunch 15

# aiHint.salary
source: Пришла зарплата 80000
en: Got paid 3500 salary

# aiHint.fuel
source: Заправил машину на 2000
en: Filled up the car for 60
